//---------------------------------------------------------------------------------------------------------------------------//
// STACK AND HEAP:
//---------------------------------------------------------------------------------------------------------------------------//
// Son abstracciones que nos permiten comprender en que parte de la memoria estan almacenando nuestras variables.
//---------------------------------------------------------------------------------------------------------------------------//


//---------------------------------------------------------------------------------------------------------------------------//
// STACK:
//---------------------------------------------------------------------------------------------------------------------------//
// En Stack se alojan todas las variables que ya sabemos cual es su longitud/tamaño.
// La ventaja de alojar memorias en el stack es que es muy rápido.
// Al conocer de antemano el tamaño de todas las variables el uso y acceso a memoria es más rápido.
//---------------------------------------------------------------------------------------------------------------------------//
fn main() {
    //La variable posee un tamaño de 32 bytes:
    let variable: i32 = 10;
}
//---------------------------------------------------------------------------------------------------------------------------//


//---------------------------------------------------------------------------------------------------------------------------//
// HEAP:
//---------------------------------------------------------------------------------------------------------------------------//
// En el Heap se almacenaran todas las variables que su tamaño pueda variar en tiempo de ejecución.
// Al desconocer de forma previa el tamaño de las variables el acceso y escritura a variables alojadas en el heap es más lento.
//---------------------------------------------------------------------------------------------------------------------------//
fn main() {
    //Vectores mutables:
    let mut vector = Vec::new();
    vector.push(4);

    //Strings:
    let mut palabra = String::new();
    palabra = String::from("Hola");
}
//---------------------------------------------------------------------------------------------------------------------------//
